app/controllers/definitions_controller.rb

  def index
    @last_time = session[:user_id]

    # session[:time] = Time.now.to_s

    @definitions = Definition.all
---
SELECT "definitions".* FROM "definitions"

  def search
    @search = params[:search]
    @definitions= Definition.where("word LIKE ?", "%#{@search}%")
---
SELECT "definitions".* FROM "definitions" WHERE (word LIKE '%cosmo%')

  def show
    @definitions = Definition.find(params[:id])
---
SELECT  "definitions".* FROM "definitions" WHERE "definitions"."id" = ? LIMIT 1  [["id", 1]]

  def edit
  @definitions = Definition.find(params[:id])
---
SELECT  "definitions".* FROM "definitions" WHERE "definitions"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @definition = Definition.new(definition_params)

    respond_to do |format|
      if @definition.save
---
INSERT INTO "definitions" ("word", "meaning", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["word", "Rails"], ["meaning", "is AWESOME"], ["created_at", "2015-09-29 18:10:40.441801"], ["updated_at", "2015-09-29 18:10:40.441801"]]

  def update
    respond_to do |format|
      if @definition.update(definition_params)
---
UPDATE "definitions" SET "word_type" = ?, "sentence" = ?, "updated_at" = ? WHERE "definitions"."id" = ?  [["word_type", "noun"], ["sentence", "Our future home is on Mars."], ["updated_at", "2015-10-07 14:31:05.449659"], ["id", 1]]

  def destroy
    @definition.destroy
---
DELETE FROM "definitions" WHERE "definitions"."id" = ?  [["id", 1]]

  def set_definition
    @definition = Definition.find(params[:id])
---
SELECT  "definitions".* FROM "definitions" WHERE "definitions"."id" = ? LIMIT 1  [["id", nil]]