app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "gavin@example.com"]]
---
  def create
    email = params[:email]
    password = params[:password]
    user = User.find_by(email: email)